# -*- mode: org; mode: auto-fill; fill-column: 80 -*-

#+TITLE: Add Reasonable Inter-process Communication
#+OPTIONS:   d:t
#+LINK_UP:  ./
#+LINK_HOME: ../

** Security Hole?

   With a little bit of a stretch, this can be considered a security hole, given
   how the connector currently allows users to specify any address to connect to,
   and the ~httplib.HTTPSConnection~ doesn't validate the certificates.  So, you
   could easily, accidentally, and unknowingly connect to an untrusted server.

   #+begin_src sh
     grep -nH HTTPSConnection ../src/connectors/cli/controller.py
   #+end_src

   #+results:
   | [[../src/connectors/cli/controller.py::174]] |
   | [[../src/connectors/cli/controller.py::181]] |
   | [[../src/connectors/cli/controller.py::202]] |

